2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_MutatieleveringOpDoelbinding/data/VR00095-Mutatie-TC01-1-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5670000</ABONNEMENT>
            <NAAM>Geen pop.bep. levering op basis van doelbinding</NAAM>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>*01</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>4b37c05f-6469-4e35-9e01-d57c0ebce1ff</brp:referentienummer>
    <brp:tijdstipVerzending>*T13:55:33.564+02:00</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Mutatiebericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Geen pop.bep. levering op basis van doelbinding</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>05004</brp:code>
    <brp:naam>Verhuizing binnengemeentelijk</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>185901</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="1">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>125038</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>125038</brp:actieVerval>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>*</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>677080426</brp:burgerservicenummer>
          <brp:administratienummer>1097207412</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>*</brp:indicatieNamenreeks>
          <brp:voornamen>*</brp:voornamen>
          <brp:voorvoegsel>*</brp:voorvoegsel>
          <brp:scheidingsteken>*</brp:scheidingsteken>
          <brp:geslachtsnaamstam>*</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datum>*</brp:datum>
          <brp:gemeenteCode>*</brp:gemeenteCode>
          <brp:woonplaatsnaam>*</brp:woonplaatsnaam>
          <brp:omschrijvingLocatie>*</brp:omschrijvingLocatie>
          <brp:landGebiedCode>*</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:code>*</brp:code>
        </brp:geslachtsaanduiding>
        <brp:adressen>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>125038</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
            <brp:soortCode>*</brp:soortCode>
            <brp:redenWijzigingCode>*</brp:redenWijzigingCode>
            <brp:aangeverAdreshoudingCode>*</brp:aangeverAdreshoudingCode>
            <brp:datumAanvangAdreshouding>*</brp:datumAanvangAdreshouding>
            <brp:identificatiecodeAdresseerbaarObject>*</brp:identificatiecodeAdresseerbaarObject>
            <brp:identificatiecodeNummeraanduiding>*</brp:identificatiecodeNummeraanduiding>
            <brp:gemeenteCode>*</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>*</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>*</brp:afgekorteNaamOpenbareRuimte>
            <brp:gemeentedeel>*</brp:gemeentedeel>
            <brp:huisnummer>*</brp:huisnummer>
            <brp:postcode>*</brp:postcode>
            <brp:woonplaatsnaam>*</brp:woonplaatsnaam>
            <brp:landGebiedCode>*</brp:landGebiedCode>
          </brp:adres>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
            <brp:datumEindeGeldigheid>*</brp:datumEindeGeldigheid>
            <brp:actieAanpassingGeldigheid>125038</brp:actieAanpassingGeldigheid>
            <brp:soortCode>*</brp:soortCode>
            <brp:redenWijzigingCode>*</brp:redenWijzigingCode>
            <brp:aangeverAdreshoudingCode>*</brp:aangeverAdreshoudingCode>
            <brp:datumAanvangAdreshouding>*</brp:datumAanvangAdreshouding>
            <brp:gemeenteCode>*</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>*</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>*</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>*</brp:huisnummer>
            <brp:postcode>*</brp:postcode>
            <brp:woonplaatsnaam>*</brp:woonplaatsnaam>
            <brp:landGebiedCode>*</brp:landGebiedCode>
          </brp:adres>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*" brp:objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:tijdstipVerval>*</brp:tijdstipVerval>
            <brp:actieVerval>125038</brp:actieVerval>
            <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
            <brp:soortCode>*</brp:soortCode>
            <brp:redenWijzigingCode>*</brp:redenWijzigingCode>
            <brp:aangeverAdreshoudingCode>*</brp:aangeverAdreshoudingCode>
            <brp:datumAanvangAdreshouding>*</brp:datumAanvangAdreshouding>
            <brp:gemeenteCode>*</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>*</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>*</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>*</brp:huisnummer>
            <brp:postcode>*</brp:postcode>
            <brp:woonplaatsnaam>*</brp:woonplaatsnaam>
            <brp:landGebiedCode>*</brp:landGebiedCode>
          </brp:adres>
        </brp:adressen>
        <brp:administratieveHandelingen>
          <brp:administratieveHandeling brp:objecttype="AdministratieveHandeling" brp:objectSleutel="*">
            <brp:code>05004</brp:code>
            <brp:naam>Verhuizing binnengemeentelijk</brp:naam>
            <brp:categorie>Actualisering</brp:categorie>
            <brp:partijCode>185901</brp:partijCode>
            <brp:toelichtingOntlening>Toelichting Ontlening</brp:toelichtingOntlening>
            <brp:bronnen>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:communicatieID="*">
                <brp:document brp:objecttype="Document" brp:voorkomenSleutel="*" brp:objectSleutel="*">
                  <brp:soortNaam>Aangifte met betrekking tot verblijfplaats</brp:soortNaam>
                  <brp:identificatie>1234</brp:identificatie>
                  <brp:aktenummer>5678901</brp:aktenummer>
                  <brp:partijCode>036101</brp:partijCode>
                </brp:document>
              </brp:bron>
            </brp:bronnen>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="actie125038">
                <brp:soortNaam>Registratie adres</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="*"/>
                </brp:bronnen>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
        </brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>